---
kind: type
id: T:Autodesk.Revit.DB.PhaseArrayIterator
source: html/c6aebfe6-d774-32a7-f908-7c6493d5bed9.htm
---
# Autodesk.Revit.DB.PhaseArrayIterator

An iterator to a phase array.

## Syntax (C#)
```csharp
public abstract class PhaseArrayIterator : APIObject,
	IEnumerator
```